Repository: HF-dev/angular-translator
Catalog: src/i18n-xlf/messages.*.xlf
Languages: fr

source: Angular Translator
fr: Traducteur Angular

source: Home
fr: Accueil

source: New project...
fr: Nouveau projet...

source: About
fr: À propos

source: Interface Language
fr: Langue de l'interface

source: Create new project
fr: Créer un nouveau projet

source: {INTERPOLATION} edition
fr: Édition {INTERPOLATION}

source: name
fr: nom

source: icon
fr: icône

source: github repo
fr: repo github

source: i18n directory
fr: répertoire i18n

source: source file name
fr: nom fichier source

source: Delete
fr: Supprimer

source: Cancel
fr: Annuler

source: Add
fr: Créer

source: Save
fr: Enregistrer

source: Reload source
fr: Recharger source

source: Export current translation
fr: Exporter traduction en cours

source: Edit project settings
fr: Éditer paramètres projet

source: Export as XMB
fr: Exporter en XMB

source: Export as Xliff
fr: Exporter en Xliff

source: {VAR_PLURAL, plural, =0 {no message} =1 {1 message} other {{INTERPOLATION} messages} }
fr: {VAR_PLURAL, plural, =0 {aucun message} =1 {1 message} other {{INTERPOLATION} messages} }

source: {VAR_PLURAL, plural, =0 {0 translated} =1 {1 translated} other {{INTERPOLATION} translated} }
fr: {VAR_PLURAL, plural, =0 {0 traduit} =1 {1 traduit} other {{INTERPOLATION} traduits} }

source: Select a translation:
fr: Sélectionnez une traduction :

source: translation
fr: traduction

source: Untranslated only
fr: Non traduits seulement

source: Done
fr: OK

source: Press ctrl-enter to save & go to next untranslated message
fr: Pressez ctrl-Entrée pour enregistrer & passer au terme non traduit suivant

source: ICU Builder (prototype)
fr: Outil ICU (prototype)

source: meaning:
fr: signification :

source: view details
fr: voir détails

source: Save & Next
fr: Enreg & Suivant

source: {START_PARAGRAPH}{START_TAG_STRONG}Angular Translator{CLOSE_TAG_STRONG} helps you translating your Angular application.{CLOSE_PARAGRAPH} {START_PARAGRAPH}Translation applications like this one are generally not specialized for a specific framework.{CLOSE_PARAGRAPH} {START_PARAGRAPH}This application prefers to specialize in the translation of Angular applications only, so it can integrate perfectly with the framework.{CLOSE_PARAGRAPH} {START_HEADING_LEVEL2}How it works{CLOSE_HEADING_LEVEL2} {START_PARAGRAPH}The {START_TAG_VAR}ng-xi18n{CLOSE_TAG_VAR} Angular tool is responsible for extracting from the app sources the terms to translate. This tool creates a {START_TAG_VAR}messages.xmb{CLOSE_TAG_VAR} (or {START_TAG_VAR}messages.xlf{CLOSE_TAG_VAR}) file containing all the necessary information for the human translator to do his job.{CLOSE_PARAGRAPH} {START_PARAGRAPH}{START_TAG_STRONG}Angular Translator{CLOSE_TAG_STRONG} gets this {START_TAG_VAR}messages.xmb{CLOSE_TAG_VAR} file and uses it at the reference for the terms that have to be translated. It is called the {START_EMPHASISED_TEXT}source file{CLOSE_EMPHASISED_TEXT} in the app.{CLOSE_PARAGRAPH} {START_PARAGRAPH}In {START_TAG_STRONG}Angular Translator{CLOSE_TAG_STRONG}, you then have to declare the different file names where the different translations for specific languages will be stored. When you begin, you do not need to create these translation files, the app will do that for you. They all called the {START_EMPHASISED_TEXT}translations files{CLOSE_EMPHASISED_TEXT} in the app.{CLOSE_PARAGRAPH} {START_PARAGRAPH}When you have finished translating for a specific language, you can export the translation file for this language and place it beside your source file in your sources repository. If you decide to work again on the translations for this same language, the translations you have made earlier will be extracted from this translation file.{CLOSE_PARAGRAPH} {START_PARAGRAPH}When you update your app and add or remove terms to translate and regenerate the {START_TAG_VAR}messages.xmb{CLOSE_TAG_VAR} source file with {START_TAG_VAR}ng-xi18n{CLOSE_TAG_VAR}, you do not need to merge the differences to your translation files. Because {START_TAG_STRONG}Angular Translator{CLOSE_TAG_STRONG} gets the {START_EMPHASISED_TEXT}source file{CLOSE_EMPHASISED_TEXT} as the reference, it will handle correclty the terms removed or added.{CLOSE_PARAGRAPH} {START_HEADING_LEVEL2}Usage{CLOSE_HEADING_LEVEL2} {START_PARAGRAPH}First declare a new project in the application, with {START_TAG_VAR}New Project...{CLOSE_TAG_VAR} in the sidenav. You will have to declare some information for this new project:{CLOSE_PARAGRAPH} {START_UNORDERED_LIST} {START_LIST_ITEM}{START_TAG_STRONG}name{CLOSE_TAG_STRONG}: a name that will appear in the sidenav - be clear and concise, {CLOSE_LIST_ITEM}{START_LIST_ITEM}{START_TAG_STRONG}icon{CLOSE_TAG_STRONG}: a name of a Material icon - select one here: https://material.io/icons/, {CLOSE_LIST_ITEM}{START_LIST_ITEM}{START_TAG_STRONG}github repo{CLOSE_TAG_STRONG}: the github repository where the app will get the files, for example {START_TAG_VAR}feloy/angular-translator{CLOSE_TAG_VAR} for translating this app, {CLOSE_LIST_ITEM}{START_LIST_ITEM}{START_TAG_STRONG}i18n directory{CLOSE_TAG_STRONG}: the directory inside the repository where source and translations files are placed, {START_TAG_VAR}src/i18n{CLOSE_TAG_VAR}generally, {CLOSE_LIST_ITEM}{START_LIST_ITEM}{START_TAG_STRONG}source file name{CLOSE_TAG_STRONG}: the name of the source file, {START_TAG_VAR}messages.xmb{CLOSE_TAG_VAR} or {START_TAG_VAR}messages.xlf{CLOSE_TAG_VAR}generally, {CLOSE_LIST_ITEM}{START_LIST_ITEM}{START_TAG_STRONG}translations files names{CLOSE_TAG_STRONG}: the names of the translations files you want to create, one for each language you want to translate your app in - they do not need to exist in the repository. {CLOSE_LIST_ITEM}{CLOSE_UNORDERED_LIST} Once your project created, the app will load the contents of the {START_EMPHASISED_TEXT}source file{CLOSE_EMPHASISED_TEXT} and extract the terms to translate. You then have to choose one language you want to work with, based on the list of files you have declared as translations files, using the select listing the different translations files names. If the translation file exists in the repository, the app loads it and extracts the translations already done. You can now begin to translate the different terms. When you are done, you can use the {START_TAG_VAR}Extract{CLOSE_TAG_VAR} button on the upper-right corner to extract the translations in the current language in a local file. You can now commit this file in your repository.
fr: {START_PARAGRAPH}{START_TAG_STRONG}Le traducteur Angular{CLOSE_TAG_STRONG} vous aide à traduire votre application Angular.{CLOSE_PARAGRAPH} {START_PARAGRAPH}Les applications de traduction comme celle-ci ne sont en général pas spécialisées pour un framework particulier.{CLOSE_PARAGRAPH} {START_PARAGRAPH}Cette application préfère se spécialiser dans la traduction d'applications Angular uniquement, pour pouvoir s'intégrer parfaitement avec le framework.{CLOSE_PARAGRAPH} {START_HEADING_LEVEL2}Comment ça marche{CLOSE_HEADING_LEVEL2} {START_PARAGRAPH}L'outil Angular {START_TAG_VAR}ng-xi18n{CLOSE_TAG_VAR} est reponsable de l'extraction depuis les sources de l'application les termes à traduire. Cet outil crée un fichier {START_TAG_VAR}messages.xmb{CLOSE_TAG_VAR} (ou {START_TAG_VAR}messages.xlf{CLOSE_TAG_VAR}) contenant toute l'information nécessaire au traducteur humain pour faire son travail.{CLOSE_PARAGRAPH} {START_PARAGRAPH}{START_TAG_STRONG}Le traducteur Angular{CLOSE_TAG_STRONG} prend ce fichier {START_TAG_VAR}messages.xmb{CLOSE_TAG_VAR} et l'utilise comme référence pour les termes devant être traduits. Il est appelé le {START_EMPHASISED_TEXT}fichier source{CLOSE_EMPHASISED_TEXT} dans l'application.{CLOSE_PARAGRAPH} {START_PARAGRAPH}Dans {START_TAG_STRONG}Le traducteur Angular{CLOSE_TAG_STRONG}, vous devez ensuite déclarer les différents noms de fichiers où les différentes traductions pour des langues spécifiques vont être enregistrés. Lorsque vous commencez, vous n'avez pas à créer ces fichiers de traductions, l'application les créeras pour vous. Ils sont appelés les {START_EMPHASISED_TEXT}fichiers de traductions{CLOSE_EMPHASISED_TEXT} dans l'application.{CLOSE_PARAGRAPH} {START_PARAGRAPH}Lorsque vous avez fini la traduction pour une langue donnée, vous pouvez exporter le fichier de traduction pour cette langue et le placer à côté de votre fichier source dans votre dépôt de sources. Si vous décidez de continuer à travailler sur les traductions de cette même langue, les traductions que vous avez faites précédemmentseront extraites de ce fichier de traductions.{CLOSE_PARAGRAPH} {START_PARAGRAPH}Lorsque vous mettez à jour votre application et ajoutez ou enlevez des termes à traduire et regénérez le fichier source {START_TAG_VAR}messages.xmb{CLOSE_TAG_VAR} avec {START_TAG_VAR}ng-xi18n{CLOSE_TAG_VAR}, vous n'avez pas à fusionner les différences dans vos fichiers de traductions. {START_TAG_STRONG}Le traducteur Angular{CLOSE_TAG_STRONG} prenant le {START_EMPHASISED_TEXT}fichier source{CLOSE_EMPHASISED_TEXT} comme référence, il va correctement prendre en compte les termes ajoutés ou supprimés.{CLOSE_PARAGRAPH} {START_HEADING_LEVEL2}Utilisation{CLOSE_HEADING_LEVEL2} {START_PARAGRAPH}Déclarez tout d'abord un nouveau projet dans l'application, avec {START_TAG_VAR}Nouveau Projet...{CLOSE_TAG_VAR} dans le menu. Vous aurez à déclarer quelques informations pour ce nouveau projet :{CLOSE_PARAGRAPH} {START_UNORDERED_LIST} {START_LIST_ITEM}{START_TAG_STRONG}nom{CLOSE_TAG_STRONG} : un nom qui apparaîtra dans le menu, soyez clair et concis, {CLOSE_LIST_ITEM}{START_LIST_ITEM}{START_TAG_STRONG}icône{CLOSE_TAG_STRONG} : le nom d'un icône Material - sélectionnez-en un ici : https://material.io/icons/, {CLOSE_LIST_ITEM}{START_LIST_ITEM}{START_TAG_STRONG}dépôt github{CLOSE_TAG_STRONG}: le dépôt github où l'application prendra les fichiers, par exemple {START_TAG_VAR}feloy/angular-translator{CLOSE_TAG_VAR} pour traduire cette application, {CLOSE_LIST_ITEM}{START_LIST_ITEM}{START_TAG_STRONG}répertoire i18n{CLOSE_TAG_STRONG} : le répertoire du dépôt dans lequel les fichiers source et traductions sont placés, en général {START_TAG_VAR}src/i18n{CLOSE_TAG_VAR}, {CLOSE_LIST_ITEM}{START_LIST_ITEM}{START_TAG_STRONG}nom du fichier source{CLOSE_TAG_STRONG} : le nom du fichier source, en général {START_TAG_VAR}messages.xmb{CLOSE_TAG_VAR} ou {START_TAG_VAR}messages.xlf{CLOSE_TAG_VAR}, {CLOSE_LIST_ITEM}{START_LIST_ITEM}{START_TAG_STRONG}noms des fichiers de traductions{CLOSE_TAG_STRONG} : les noms des fichiers de traductions que vous voulez créer, un pour chaque langue dans laquelle vous désirez traduire votre application - ils ont pas nécessairement à exister dans le dépôt. {CLOSE_LIST_ITEM}{CLOSE_UNORDERED_LIST} Une fois votre projet créé, l'application va lire le contenu du {START_EMPHASISED_TEXT}fichier source{CLOSE_EMPHASISED_TEXT} et extraire les termes à traduire. Vous avez alors à choisir une des langues avec laquelle travailler, selon la lste des fichiers que vous avez déclarés comme fichiers de traductions, dans la liste de sélection contenant le différents noms de fichiers de traductions. Si le fichier de traductions existe dans le dépôt, l'application le lit et en extrait les traductions déjà faites. Vous pouvez maintenant commencer à traduire les différents termes. Lorsque vous avez terminé, vous pouvez utiliser le bouton {START_TAG_VAR}Exporter{CLOSE_TAG_VAR} dans le coin en haut à droite pour extraire les traductions de la langue en cours de traduction dans un fichier local. Vous pouvez ensuite envoyer (commit) ce fichier dans votre dépôt.
